robotology/icub-firmware/emBODY/eBcode/arch-arm/libs/lowlevel/stm32hal/cubemx/rfe/RFE_MASTER.ioc
STMicroelectronics.BlueNRG-MS.1.0.0.WirelessJjApplication.diagnostic0=This component requires one or more component from the same SW pack to operate correctly
STMicroelectronics.BlueNRG-MS.1.0.0.WirelessJjApplication.diagnostic1=This component requires one or more component from the same SW pack to operate correctly
STMicroelectronics.BlueNRG-MS.1.0.0.WirelessJjApplication.documentation0=Documentation/STMicroelectronics.BlueNRG-MS_GettingStarted.pdf
STMicroelectronics.BlueNRG-MS.1.0.0.WirelessJjApplication.documentation1=Documentation/STMicroelectronics.BlueNRG-MS_GettingStarted.pdf
STMicroelectronics.BlueNRG-MS.1.0.0.WirelessJjApplication.group0=Application
STMicroelectronics.BlueNRG-MS.1.0.0.WirelessJjApplication.group1=Application
STMicroelectronics.BlueNRG-MS.1.0.0.WirelessJjApplication.paramName0=ApplicationCcWirelessJjApplication
STMicroelectronics.BlueNRG-MS.1.0.0.WirelessJjApplication.paramName1=ApplicationCcWirelessJjApplication
STMicroelectronics.BlueNRG-MS.1.0.0.WirelessJjApplication.sevirity0=minor
STMicroelectronics.BlueNRG-MS.1.0.0.WirelessJjApplication.sevirity1=minor
STMicroelectronics.BlueNRG-MS.1.0.0.WirelessJjApplication.variant0=SensorDemo
STMicroelectronics.BlueNRG-MS.1.0.0.WirelessJjApplication.variant1=VirtualCOMPort
STMicroelectronics.BlueNRG-MS.1.0.0.WirelessJjApplication_Checked=false
STMicroelectronics.BlueNRG-MS.1.0.0.WirelessJjApplication_apiSize=4
STMicroelectronics.BlueNRG-MS.1.0.0.WirelessJjApplication_class=Wireless
STMicroelectronics.BlueNRG-MS.1.0.0.WirelessJjApplication_name=BlueNRG-MS
STMicroelectronics.BlueNRG-MS.1.0.0.WirelessJjApplication_size=2
STMicroelectronics.BlueNRG-MS.1.0.0.WirelessJjApplication_vendor=STMicroelectronics
STMicroelectronics.BlueNRG-MS.1.0.0.WirelessJjApplication_version=1.0.0
STMicroelectronics.BlueNRG-MS.1.0.0_MwName0=Application
STMicroelectronics.BlueNRG-MS.1.0.0_NumberOfMw=1
STMicroelectronics.BlueNRG-MS.1.0.0_SwParameter=ApplicationCcWirelessJjApplication\:VirtualCOMPort;
STMicroelectronics.BlueNRG-MS.1.0.0_WirelessJjApplication_RteComponent0=\#define SENSOR_DEMO
STMicroelectronics.BlueNRG-MS.1.0.0_WirelessJjApplication_RteComponent1=\#define VIRTUAL_COM_PORT
STMicroelectronics.BlueNRG-MS.1.0.0_WirelessJjApplication_RteComponentsize=2
STMicroelectronics.BlueNRG-MS.1.0.0_WirelessJjBlueNRGAaMS_RteComponentsize=0
STMicroelectronics.BlueNRG-MS.1.0.0_description=BLE stack and sample applications for BlueNRG-MS module
STMicroelectronics.BlueNRG-MS.1.0.0_license=END_USER_LICENCE_AGREEMENT.pdf
TIM16.IPParameters=Prescaler,Period
TIM16.Period=100
TIM16.Prescaler=8000
TIM2.Channel-PWM\ Generation1\ CH1=TIM_CHANNEL_1
TIM2.IPParameters=Channel-PWM Generation1 CH1,Prescaler,Period
TIM2.Period=100
TIM2.Prescaler=8000
TIM6.IPParameters=Prescaler,Period
TIM6.Period=100
TIM6.Prescaler=8000
USB_DEVICE.CLASS_NAME_FS=CDC
USB_DEVICE.IPParameters=VirtualMode,VirtualModeFS,CLASS_NAME_FS
USB_DEVICE.VirtualMode=Cdc
USB_DEVICE.VirtualModeFS=Cdc_FS
VP_RNG_VS_RNG.Mode=RNG_Activate
VP_RNG_VS_RNG.Signal=RNG_VS_RNG
VP_SYS_VS_Systick.Mode=SysTick
VP_SYS_VS_Systick.Signal=SYS_VS_Systick
VP_TIM16_VS_ClockSourceINT.Mode=Enable_Timer
VP_TIM16_VS_ClockSourceINT.Signal=TIM16_VS_ClockSourceINT
VP_TIM6_VS_ClockSourceINT.Mode=Enable_Timer
VP_TIM6_VS_ClockSourceINT.Signal=TIM6_VS_ClockSourceINT
VP_USB_DEVICE_VS_USB_DEVICE_CDC_FS.Mode=CDC_FS
VP_USB_DEVICE_VS_USB_DEVICE_CDC_FS.Signal=USB_DEVICE_VS_USB_DEVICE_CDC_FS
board=RFE_MASTER
